In [2]:
import pandas as pd
import numpy as np

# Main Database

In [3]:
series =pd.Series(["BMW","TOYOTA","HONDA"])

In [4]:
series

0       BMW
1    TOYOTA
2     HONDA
dtype: object

# Series = 1-Demensional

In [5]:
colours=pd.Series(["red","blue","white"])
colours

0      red
1     blue
2    white
dtype: object

# Dataframe = 2-Demensional

In [6]:
car_data=pd.DataFrame({"Car make":series,"colours":colours})
car_data

  Car make colours
0      BMW     red
1   TOYOTA    blue
2    HONDA   white

# Import Data

In [10]:
car_sales=pd.read_csv("51 - car-sales.csv")

In [11]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Exporting a dataframe

In [12]:
car_sales.to_csv("exported-car-sales.csv")

In [17]:
export_car_sales=pd.read_csv("exported-car-sales.csv")
export_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00